*** C++
    - points
      - both function ~accept~ of class ~Element~ and function ~visit~ of class ~Vistor~ should be virtual function.
        virtual function is the only way that providing message dispatch at runtime in C++.
      - call sequence
      - A1, A2 实现中的accept 定义是必须的，不能直接在基类中定义。这样才能使不同的A的子类调用相应的visit函数。
      - 在V的visit函数中， A1， A2的所有方法都能够访问到，相当于通过组合的方式添加了一个功能。



    #+begin_src C++ :includes <iostream> 
    using namespace std;

    class A1;
    class A2;
    class V {
    public:
      virtual void visit(A1& a1){
        cout<<"V: a1"<<endl;
      }
      virtual void visit(A2& a2){
        cout<<"V: a2"<<endl;
      }
    };
    class V1:public V {
    public:
      void visit(A1& a1){
        cout<<"V1: a1"<<endl;
      }
      void visit(A2& a2){
        cout<<"V1: a2"<<endl;
      }
    };
    class V2:public V {
    public:
      void visit(A1& a1){
        cout<<"V2: a1"<<endl;
      }
      void visit(A2& a2){
        cout<<"V2: a2"<<endl;
      }
    };
    class A {
    public:
      virtual void accept(V& v)=0;
    };
    class A1:public A{
    public:
      void accept(V& v){
        v.visit(*this);
      }
    };
    class A2:public A{
    public:
      void accept(V& v){
        v.visit(*this);
      }
    };

    int main(){
      A1 a1;
      A2 a2;
      A* a = &a1;
      V1 v1;
      V2 v2;
      V* v=&v1;
      a->accept(*v);
      v=&v2;
      a->accept(*v);
      a = &a2;
      v=&v1;
      a->accept(*v);
      v=&v2;
      a->accept(*v);

      return 0;
    }
    #+end_src

    #+RESULTS:
    | V1: | a1 |
    | V2: | a1 |
    | V1: | a2 |
    | V2: | a2 |
    Note:
    - 感觉要做到的效果都是： 调用时，对于所有不同的情况，写法完全一致。 感觉所有design pattern 想要做到的效果都是这样。
    - Sun Sep  4 14:06:18 2016. 必须做笔记，不然完全会全忘掉。则当时的思考完全没有效果。

      

    
